Enums/ВидыДополнительнойИнформацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДополнительнойИнформацииОбъектов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/vrgТребованияНакладнаяМобыльный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>vrgТребованияНакладнаяМобыльный</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Улицы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБокса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОпоры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьиЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранзакцииAbills</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговаяАкция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.vrgЗаказКлиентаМобильный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/vrgЗаказКлиентаМобильный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>vrgЗаказКлиентаМобильный</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отобран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезналичныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТранзакцииAbills</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплаченБезналичными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОплату</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДоп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗаказ</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/MobileExchange/Ext/Module.bsl
Функция hello()
	Возврат "Привет!";
КонецФункции

Функция Пинг()
	Возврат Истина;
КонецФункции

//Функция ЗагрузитьДанныеСМобильногоУстройства(КодУстройства, ДанныеОбмена, ТекстОшибки)
//	
//	УстановитьПривилегированныйРежим(Истина);

//	УзелУстройства = ПланыОбмена.Мобильные.НайтиПоКоду(КодУстройства);

//	Если УзелУстройства.Пустая() Тогда
//		ТекстОшибки = ТекстОшибки + ("Устройство с кодом " + КодУстройства+" не опознано.");
//		Возврат Ложь;
//	КонецЕсли;

//	Попытка	
//		ДанныеОбмена = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ЗагрузитьДанныеСМобильногоУстройства(УзелУстройства, ДанныеОбмена, ТекстОшибки);
//	Исключение
//		ТекстОшибки = ТекстОшибки + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
//		Возврат Ложь;
//	КонецПопытки;

//	Возврат Истина;

//	
//КонецФункции

//Функция ВыгрузитьДанныеНаМобильноеУстройство(КодУстройства, ТекстОшибки,ДополнительныеПараметры)
//	
//	УстановитьПривилегированныйРежим(Истина);

//	ДанныеОбмена = Новый ХранилищеЗначения(Неопределено);
//	УзелУстройства = ПланыОбмена.Мобильные.НайтиПоКоду(КодУстройства);

//	Если УзелУстройства.Пустая() Тогда
//		ТекстОшибки = ТекстОшибки + ("Устройство с кодом " + КодУстройства+" не опознано.");
//		Возврат ДанныеОбмена;
//	КонецЕсли;
//	
//	СтруктураПараметров = ДополнительныеПараметры.Получить();
//	
//	Попытка
//		ДанныеОбмена = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ВыгрузитьДанныеНаМобильноеУстройство(УзелУстройства, ТекстОшибки,СтруктураПараметров);
//	Исключение
//		ТекстОшибки = ТекстОшибки + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
//	КонецПопытки;

//	Возврат ДанныеОбмена;

//КонецФункции

//Функция ВыполнитьНачальнуюИнициалиазацию(КодУстройства, ТекстОшибки)
//	
//	УстановитьПривилегированныйРежим(Истина);

//	УзелУстройства = ПланыОбмена.Мобильные.НайтиПоКоду(КодУстройства);

//	Если УзелУстройства.Пустая() Тогда
//		ТекстОшибки = ТекстОшибки + ("Устройство с кодом " + КодУстройства+" не опознано.");
//		Возврат Ложь;
//	КонецЕсли;

//	Попытка
//		ДанныеОбмена = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ВыполнитьНачальнуюИнициализацию(УзелУстройства);
//	Исключение
//		ТекстОшибки = ТекстОшибки + КраткоеПредставлениеОшибки(ИнформацияОбОшибке())+ ОписаниеОшибки();
//		Возврат Ложь;
//	КонецПопытки;

//	Возврат Истина;
//	
//КонецФункции


Функция ПередатьСсылкиТоваров(КодУстройства, ТаблицаДанных, ТекстОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаИзвлеченныхДанных = ТаблицаДанных.Получить();
	
	//ТекстОшибки = Строка(ТипЗнч(ТаблицаДанных));
	
	
	Для Каждого СтрокаДанных из ТаблицаИзвлеченныхДанных Цикл 
		Идентификатор = СтрокаДанных.Идентификатор;
		Код           = СтрокаДанных.Код;
		Наименование  = СтрокаДанных.Наименование;
		
		Если Не ЗначениеЗаполнено(Идентификатор)
			или Не ЗначениеЗаполнено(Код)
				или Не ЗначениеЗаполнено(Наименование)Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда 
			ТекСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
			
			НоваяСсылка = (НАЙТИ(Строка(ТекСсылка), "<Объект не найден> ") <> 0);
				
			Если НоваяСсылка = Истина Тогда 
				НовСпр = Справочники.Номенклатура.СоздатьЭлемент();
				НовСпр.УстановитьСсылкуНового(ТекСсылка);
				НовСпр.Код 					= Код;
				НовСпр.Наименование 		= Наименование;
				НовСпр.НаименованиеПолное	= Наименование;
				НовСпр.ОбменДанными.Загрузка = Истина;
				
				Попытка
					НовСпр.Записать();
				Исключение
					ТекстОшибки = ""+ТекстОшибки + ""+ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	//Если Не ЗначениеЗаполнено(Идентификатор)
	//	или Не ЗначениеЗаполнено(Код)
	//		или Не ЗначениеЗаполнено(Наименование)Тогда 
	//	Возврат Ложь;	
	//КонецЕсли;
	//
	//
	//Если ЗначениеЗаполнено(Идентификатор) Тогда 
	//	ТекСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	//	
	//	НоваяСсылка = (НАЙТИ(Строка(ТекСсылка), "<Объект не найден> ") <> 0);
	//			
	//	Если НоваяСсылка = Истина Тогда 
	//		НовСпр = Справочники.Номенклатура.СоздатьЭлемент();
	//		НовСпр.УстановитьСсылкуНового(ТекСсылка);
	//		НовСпр.Код 					= Код;
	//		НовСпр.Наименование 		= Наименование;
	//		НовСпр.НаименованиеПолное	= Наименование;
	//		НовСпр.ОбменДанными.Загрузка = Истина;
	//		
	//		Попытка
	//			НовСпр.Записать();
	//		Исключение
	//			ТекстОшибки = ""+ТекстОшибки + ""+ОписаниеОшибки();
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	//
	Возврат Истина;	

КонецФункции

Функция ВыполнитьЗапрос(СтруктураДаных,ДополнительныеПараметры)
	
	УстановитьПривилегированныйРежим(Истина);
		
	СтруктураВЗапрос = СтруктураДаных.Получить();
	
	СтруктураДополнительныеПараметры = ДополнительныеПараметры.Получить();
	
	Если СтруктураВЗапрос = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса 		= СтруктураВЗапрос.ТекстЗапроса;
	СтруктураПараметров = СтруктураВЗапрос.СтруктураПараметров;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Для Каждого Элемент Из СтруктураПараметров Цикл
		Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
	КонецЦикла;		
	
	Результат = Запрос.Выполнить().Выгрузить();	
	
	Возврат Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	
КонецФункции

//Функция СоздатьДокумент(КодУстройства, ИмяДокумента, Дата, ДополнительныеПараметры)
//	
//	УстановитьПривилегированныйРежим(Истина);
//	ГУИД = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.СоздатьДокумент(ИмяДокумента,Дата,ДополнительныеПараметры.Получить());
//	
//	Возврат ГУИД;
//КонецФункции

//Функция ЗаписатьДанныеОтсканированоИнвентаризация(КодУстройства, УникальныйИдентификаторДокумента, Отсканировано, ИмяДокумента, ДополнительныеПараметры)
//	УстановитьПривилегированныйРежим(Истина);
//	ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ЗаписатьДанныеОтсканированоИнвентаризацияВУТ(УникальныйИдентификаторДокумента, Отсканировано.Получить(), ИмяДокумента, ДополнительныеПараметры.Получить());
//	Возврат Истина;
//КонецФункции

//Функция ПолучитьСписокДокументовИнвентаризацияВУТ(КодУстройства, Дата, ДополнительныеПараметры)
//	УстановитьПривилегированныйРежим(Истина);
//	Данные = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ПолучитьСписокДокументовИнвентаризацияВУТ(Дата,ДополнительныеПараметры.Получить());
//	Возврат Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
//КонецФункции

//Функция ПолучитьСписокОтсканированныхШтрихкодовДокументаИнвентаризацияВУТ(КодУстройства, УникальныйИдентификаторДокумента, ИмяДокумента, ДополнительныеПараметры)
//	УстановитьПривилегированныйРежим(Истина);
//	Данные = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ПолучитьСписокОтсканированныхШтрихкодовДокументаИнвентаризацияВУТ(УникальныйИдентификаторДокумента, ИмяДокумента,ДополнительныеПараметры.Получить());
//	// + 004912 TselkovskayaNK 08.06.2021
//	//Возврат Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
//	Возврат СериализаторJSON(Данные);
//	// - 004912 TselkovskayaNK 08.06.2021
//КонецФункции

// + 004912 TselkovskayaNK 08.06.2021
Функция СериализаторJSON(ДанныеВходные) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,ДанныеВходные,НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	Возврат СтрокаJSON;

КонецФункции
// - 004912 TselkovskayaNK 08.06.2021

// + 004912 TselkovskayaNK 08.06.2021
Функция ДесериализаторJSON(ДанныеВходные) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеВходные);
	ДанныеВозврат = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат ДанныеВозврат;

КонецФункции


//+ВладЧ
Функция ПолучитьТаблицуБезФото(ДополнительныеПараметры)

	УстановитьПривилегированныйРежим(Истина);
	Данные = ПолучитьТаблицуБезФотоСервер();
	Возврат Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
	
КонецФункции

функция ПолучитьТаблицуБезФотоСервер()
	   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Объект
		|ПОМЕСТИТЬ ДопИнфо
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект ССЫЛКА Справочник.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ХранилищеДополнительнойИнформации.Объект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Артикул,
		|	Номенклатура.Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.Ссылка В
		|				(ВЫБРАТЬ
		|					ДопИнфо.Объект
		|				ИЗ
		|					ДопИнфо)";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("УИД");
	Для Каждого Строка из РезультатЗапроса Цикл
		Строка.УИД = Строка.Ссылка.УникальныйИдентификатор();
	КонецЦикла;
	Возврат  РезультатЗапроса
	
КонецФункции

Функция ЗагрузитьФото(УИД = Неопределено,ДополнительныеПараметры,ТипДок = Неопределено,УИДДокумента = Неопределено)
	
	 ЗаписьЖурналаРегистрации("Обмен мобм",,,"Нач 1");
	 
	ТаблицаФотографий = ДополнительныеПараметры.Получить();
	СсылнаНоменклатура = Null;
	//СсылнаНоменклатура = Документы.vrgТребованияНакладнаяМобыльный.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Если ТипДок = "РТИУ" Тогда 
		СсылнаНоменклатура = НайтиДокПоНомеруРеализация(УИДДокумента);
	ИначеЕсли ТипДок = "Требование" Тогда
		СсылнаНоменклатура = НайтиДокПоНомеру(УИДДокумента);
	ИначеЕсли ТипДок = "ЗаказПокупателя" Тогда
		СсылнаНоменклатура = НайтиДокПоЗаказ(УИДДокумента);
	ИначеЕсли ТипДок = "ВозвратПокупателю" Тогда
		СсылнаНоменклатура = НайтиДокПоВозврату(УИДДокумента);
	ИначеЕсли ТипДок = "Инвентаризация" Тогда
		СсылнаНоменклатура = НайтиДокПоИнвентаризации(УИДДокумента);
	Иначе
		
		Возврат "";
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СсылнаНоменклатура) Тогда
		
		
		Для каждого СтрокаФото Из ТаблицаФотографий Цикл 
			
			
			НовыйОбъект = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
			НовыйОбъект.ВидДанных = Перечисления.ВидыДополнительнойИнформацииОбъектов.Изображение;
			
			
			
			НовыйОбъект.Хранилище = Новый ХранилищеЗначения(Новый Картинка(СтрокаФото.Фото.Получить()), Новый СжатиеДанных);
			НовыйОбъект.Объект = СсылнаНоменклатура;
			НовыйОбъект.ИмяФайла = ""+СсылнаНоменклатура.Номер + СтрокаФото.ИмяФайла + "Создан на OCT";
			НовыйОбъект.Записать();
			
			

		КонецЦикла;
		
		
		Возврат УИД;
	Иначе
		
		
		Возврат "";
		
	КонецЕсли;
	
	
КонецФункции
	
функция НайтиДокПоНомеру(УИДДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	vrgТребованияНакладнаяМобыльный.Ссылка,
	|	vrgТребованияНакладнаяМобыльный.Номер
	|ИЗ
	|	Документ.vrgТребованияНакладнаяМобыльный КАК vrgТребованияНакладнаяМобыльный
	|ГДЕ
	|	vrgТребованияНакладнаяМобыльный.УИДДокумента ПОДОБНО &УИДДокумента";
	
	Запрос.УстановитьПараметр("УИДДокумента", УИДДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
КонецФункции

функция НайтиДокПоЗаказ(УИДДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	vrgЗаказКлиентаМобильный.Ссылка,
	|	vrgЗаказКлиентаМобильный.УИДДокумента
	|ИЗ
	|	Документ.vrgЗаказКлиентаМобильный КАК vrgЗаказКлиентаМобильный
	|ГДЕ
	|	vrgЗаказКлиентаМобильный.УИДДокумента ПОДОБНО &УИДДокумента";
	
	Запрос.УстановитьПараметр("УИДДокумента", УИДДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
КонецФункции

функция НайтиДокПоВозврату(УИДДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	vrgЗаказКлиентаМобильный.Ссылка,
	|	vrgЗаказКлиентаМобильный.УИДДокумента
	|ИЗ
	|	Документ.vrgВозвратМобильный КАК vrgЗаказКлиентаМобильный
	|ГДЕ
	|	vrgЗаказКлиентаМобильный.УИДДокумента ПОДОБНО &УИДДокумента";
	
	Запрос.УстановитьПараметр("УИДДокумента", УИДДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
КонецФункции

функция НайтиДокПоИнвентаризации(УИДДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	vrgЗаказКлиентаМобильный.Ссылка,
	|	vrgЗаказКлиентаМобильный.УИДДокумента
	|ИЗ
	|	Документ.vrgИнвентаризацияМобильная КАК vrgЗаказКлиентаМобильный
	|ГДЕ
	|	vrgЗаказКлиентаМобильный.УИДДокумента ПОДОБНО &УИДДокумента";
	
	Запрос.УстановитьПараметр("УИДДокумента", УИДДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	
КонецФункции


функция НайтиДокПоНомеруРеализация(УИДДокумента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	vrgРеализацияМобильная.Ссылка,
	|	vrgРеализацияМобильная.Номер,
	|	vrgРеализацияМобильная.УИДДокумента
	|ИЗ
	|	Документ.vrgРеализацияМобильная КАК vrgРеализацияМобильная
	|ГДЕ
	|	vrgРеализацияМобильная.УИДДокумента ПОДОБНО &УИДДокумента";
	
	Запрос.УстановитьПараметр("УИДДокумента", УИДДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции


Функция НайтиНоменклатуру(ДополнительныеПараметры)
	СтруктураПараметров = ДополнительныеПараметры.Получить();
	СтрокаПоиска 		= СтруктураПараметров.СтрокаПоиска;
	
	 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Наименование,
		|	Номенклатура.Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование = &Наименование
		|	ИЛИ Номенклатура.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Артикул", СтрокаПоиска);
	Запрос.УстановитьПараметр("Наименование", СтрокаПоиска);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Колонки.Добавить("УИД");
	Для Каждого Строка из РезультатЗапроса Цикл
		Строка.УИД = Строка.Ссылка.УникальныйИдентификатор();
	КонецЦикла; 
		
	
	Возврат Новый ХранилищеЗначения(РезультатЗапроса, Новый СжатиеДанных(9));
КонецФункции

Функция ЗагрузитьВсеФото(УИД, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецФункции

//Функция ПолучитьСписокОтсканированныхДокументПеремещения(КодУстройства, УникальныйИдентификаторДокумента, ИмяДокумента, ДополнительныеПараметры)
//	УстановитьПривилегированныйРежим(Истина);
//	Данные = ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ПолучитьСписокОтсканированныхШтрихкодовДокументаПеремещенияВУТ(УникальныйИдентификаторДокумента, ИмяДокумента,ДополнительныеПараметры.Получить());
//	Возврат Новый ХранилищеЗначения(Данные, Новый СжатиеДанных(9));
//КонецФункции

//Функция ЗаписатьДанныеДокументПеремещения(КодУстройства, УникальныйИдентификаторДокумента, Отсканировано, ИмяДокумента, ДополнительныеПараметры)
//	УстановитьПривилегированныйРежим(Истина);
//	ПроцедурыОбменаДаннымиСМобильнымиУстройствами.ЗаписатьДанныеДокументПеремещения(УникальныйИдентификаторДокумента, Отсканировано.Получить(), ИмяДокумента, ДополнительныеПараметры.Получить());
//	Возврат Истина;
//КонецФункции
//+ВладЧ
